---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FillPatternIdParam
source: html/dd13cebc-b77b-0a64-0b3b-fede70c04994.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FillPatternIdParam Property

"Cut fill pattern"

## Syntax (C#)
```csharp
public static ForgeTypeId FillPatternIdParam { get; }
```